app/controllers/data_points_controller.rb

SELECT * FROM "data_points" WHERE ("data_points"."id" = 1)
SELECT * FROM "wells" WHERE ("wells"."id" = 2)
---
  def show
    @data_point = DataPoint.find(params[:id])
    @well = Well.find(@data_point.well_id)

SELECT * FROM "data_points" WHERE (date = '1' and well_id = '2011-01-10') LIMIT 1
SELECT * FROM "wells" WHERE ("wells"."id" = 1)
---
  def new
  	puts "making a new data point!"
    @data_point = DataPoint.new

    @data_point_already_exists = DataPoint.data_point_exists(params[:well_id], params[:date])

    @data_point.date = params[:date]
    @data_point.well_id = params[:well_id]

    @well = Well.find(@data_point.well_id)

SELECT * FROM "data_points" WHERE ("data_points"."id" = 1)
---
  def edit
    @data_point = DataPoint.find(params[:id])

SELECT "wells".id FROM "wells" WHERE ("wells"."id" = 1) LIMIT 1
SELECT * FROM "data_points" WHERE (date = '2010-04-25' and well_id = 2) LIMIT 1
INSERT INTO "data_points" ("created_at", "updated_at", "gas_amt", "date", "oil_amt", "well_id") VALUES('2011-01-21 02:56:33', '2011-01-21 02:56:33', 234, '2010-05-25', 234, 234)
---
  def create
    @data_point = DataPoint.new(params[:data_point])

    @well = Well.find(@data_point.well_id)

    @data_point_already_exists = DataPoint.data_point_exists(@data_point.well_id, @data_point.date)

    puts "creating a data point"
    puts @data_point_already_exists

    respond_to do |format|
      if @data_point_already_exists
        flash[:notice] = 'This data point was already created'
        format.html { redirect_to(:controller => "wells", :action => "view_data", :id => @well.id) }
      elsif @data_point.save

SELECT * FROM "data_points" WHERE (date = '2010-04-25' and well_id = 2) LIMIT 1
UPDATE "data_points" SET "updated_at" = '2011-01-21 03:02:58', "gas_amt" = 234234 WHERE "id" = 1
---
  def update
    @data_point = DataPoint.find(params[:id])

    respond_to do |format|
      if @data_point.update_attributes(params[:data_point])

SELECT * FROM "data_points" WHERE ("data_points"."id" = 1)
DELETE FROM "data_points" WHERE "id" = 1
---
  def destroy
    @data_point = DataPoint.find(params[:id])
    @data_point.destroy