app/controllers/fields_controller.rb

  def show
    @field = Field.find(params[:id])
---
SELECT * FROM "fields" WHERE ("fields"."id" = 1)

  def create
    @field = Field.new(params[:field])

    respond_to do |format|
      if @field.save
---
INSERT INTO "fields" ("name", "created_at", "updated_at") VALUES('a test field', '2011-01-20 03:52:10', '2011-01-20 03:52:10')