app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :email)

INSERT INTO "users" ("salt", "created_at", "updated_at", "hashed_password", "role", "email") VALUES('21801931600.36104439589768', '2011-01-23 21:26:07', '2011-01-23 21:26:07', 'cd96ed311140609bb1468b21d1dcf8982191c76a', 'admin', 'sarahleeashraf@gmail.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 3) LIMIT 1
UPDATE "users" SET "updated_at" = '2011-01-23 22:09:16', "salt" = '21776786600.603992019502869', "hashed_password" = '435e0d645647a28999d941ac4614714d53777d95' WHERE "id" = 4
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
DELETE FROM "users" WHERE "id" = 2
---
  def destroy
    @user = User.find(params[:id])
    begin
      @user.destroy