app/controllers/wells_controller.rb

  def show
    @well = Well.find(params[:id])
---
SELECT * FROM "wells" WHERE ("wells"."id" = 1)

  def edit
    @well = Well.find(params[:id])
---
SELECT * FROM "wells" WHERE ("wells"."id" = 1)

  def create
    @well = Well.new(params[:well])

    respond_to do |format|
      if @well.save
---
INSERT INTO "wells" ("name", "created_at", "field_id", "updated_at") VALUES('something', '2011-01-20 04:03:22', 3000, '2011-01-20 04:03:22')

  def update
    @well = Well.find(params[:id])

    respond_to do |format|
      if @well.update_attributes(params[:well])
---
SELECT * FROM "wells" WHERE ("wells"."id" = 1)
UPDATE "wells" SET "updated_at" = '2011-01-20 04:03:32', "field_id" = 1 WHERE "id" = 1

  def view_data
  	@well = Well.find(params[:id])
---
SELECT * FROM "wells" WHERE ("wells"."id" = 1)

  def add_data
    @well = Well.find(params[:id])
---
SELECT * FROM "wells" WHERE ("wells"."id" = 3)